window.HALL1_EXHIBITS = [
  // hall 1 – Домеханическая эпоха
  {id:"abacus",
  hall:"hall1",
  icon:"🧮",
  kicker:"Домеханическая эпоха",
  name:"Абак",
  period:"~3000 до н.э.",
  short:"Ручное счетное устройство",
  desc:"Семейство счётных досок, применявшихся для арифметических вычислений со времён древности во множестве цивилизаций и государств вплоть до XVIII века.",
  history:"Впервые абак появился, вероятно, в Древнем Вавилоне в III тысячелетии до н. э. Первоначально представлял собой доску, разграфлённую на полосы или со сделанными углублениями. Устройства, схожие с древнеегипетским абаком находили в различных регионах - в Древней Индии, Западной Европе, Мезоамерике (у Ацтеков), в Центральных Андов (у Инков), на Дальнем Востоке (в Китае и Японии), а так же в России, но уже в более позднее время (XV - XVI века). Стоит отметить, что в России абак (счеты) использовались до второй половины XX века, до появления первых электронных калькуляторов в торговле. В настоящее время абак используется для обучения системе мысленных вычислений, где абак используется не физически, а мысленно, что способствует развитию способностей к счету с быстрой скоростью.",
  work:"Абак позволяет переводить счет в простые перемещения костяшек по разрядам. Каждая костяшка представляет определённое значение, а их расположение соответствует разряду (единицы, десятки, сотни и т.д.). Для выполнения арифметических операций пользователь перемещает костяшки, что позволяет быстро и эффективно производить вычисления без необходимости в письменных записях или устном счете. В зависимости от происхождения абака и его конструкции, правила перемещения костяшек могут различаться, но общая идея заключается в том, что абак служит инструментом для визуализации счета в процессе вычислений.",
  bullets:["Первый аналоговый калькулятор", "Многовековое использование"],
  tags:["счет", "античность"],
  sources:["https://ru.wikipedia.org/wiki/Абак?"],
  video:"https://www.youtube.com/watch?v=jmom9og7ayM",
  videoText:"Счет на абаке - Youtube",
  quiz:[
    {question:"Что такое абак?", options:["Калькулятор","Счетное устройство","Компьютер"], correct:1},
    {question:"В каком веке появился?", options:["I век","III тысячелетие до н.э.","XX век"], correct:1},
    {question:"Как работает?", options:["С электричеством","С костяшками","С шестернями"], correct:1},
    {question:"Где использовался?", options:["В Древнем Египте","В Древней Руси","В Южной Африке"], correct:0}
  ],
  image:"images/hall1/abakus3.png",
  modalImages: [
    "images/hall1/abakus3.png",
    "images/hall1/abakus1.JPG",
    "images/hall1/abakus2.JPG"
    ]},

  {id:"antikythera",
  hall:"hall1",
  icon:"🪐",
  kicker:"Домеханическая эпоха",
  name:"Антикитерский механизм",
  period:"~II–I век до н.э.",
  short:"Механический аналоговый вычислитель.",
  desc:"Древнегреческий астрономический инструмент, предназначенный для моделирования движения небесных тел и предсказания астрономических событий.",
  history:"Артефакт был поднят со дна Эгейского моря греческим водолазом Ликопантисом в 1901 году. Артефакт был найден на затонувшем судне (на глубине от 43 до 62 м) неподалеку от острова Антикитера, который и подарил ему свое имя. Возможно, корабль шёл с острова Родос, где во II веке до нашей эры жил и работал известный греческий астроном и математик Гиппарх Никейский.",
  work:"Механизм представляет собой календарь, а также астрономическое, метеорологическое, образовательное и картографическое устройство, состоящее из 30 бронзовых шестеренок. Это самый древний образец аналогового вычислительного устройства, первая известная механическая Солнечная система, планетарий и астрономические часы. Вращение шестеренок позволяло визуализировать  движение известных в то время планет, предсказывать затмения и другие астрономические явления.",
  bullets:["Первый аналоговый компьютер", "Сложнейший механизм своего времени"],
  tags:["шестерни","астрономия", "античность"],
  sources:[
    "https://habr.com/ru/companies/ua-hosting/articles/547282/", 
    "https://ru.wikipedia.org/wiki/Антикитерский_механизм"
  ],
  video:"https://rutube.ru/video/d2a71b3ebc91a4029b488e47fd4a3c7d/",
  videoText:"Устройство Антикитерского механизма - Рутуб",
  quiz:[
    {question:"Что такое Антикитерский механизм?", options:["Калькулятор","Астрономический инструмент","Телескоп"], correct:1},
    {question:"Когда был найден?", options:["1901 год","1931 год","2000 год"], correct:0},
    {question:"Как работает?", options:["С шестернями","С электричеством","С магнитами"], correct:0},
    {question:"Для чего использовался?", options:["Для счета","Для предсказания затмений","Для письма"], correct:1}
  ],
  modalImages: [
    "images/hall1/antikera2.png",
    "images/hall1/antikera1.jpg",
    "images/hall1/antikera3.jpg",
    "images/hall1/antikera4.png",
    "images/hall1/antikera5.jpeg"
  ]},

  {id:"neperBones",
  hall:"hall1",
  icon:"🏷",
  kicker:"Домеханическая эпоха",
  name:"Палочки Непера",
  period:"1617",
  short:"Инструмент для умножения.",
  desc:"Устройство для умножения и деления, представляющее собой набор прямоугольных палочек, на которых нанесены числа и их произведения.",
  history:"Палочки Непера были созданы шотландским математиком Джоном Непером в 1617 году. Непер был известен своими работами в области логарифмов и тригонометрии.",
  work:"Состоит из 10 палочек, имеющих форму удлинённого прямоугольного параллелепипеда. Каждая из боковых граней палочки делилась поперечными чертами на 9 квадратов, разделённых, в свою очередь, проводимыми в одном и том же направлении диагоналями на пары треугольников. На каждом квадрате была нанесена цифра от 1 до 9, а на диагоналях были указаны произведения этих цифр на номер палочки. Для умножения двух чисел, например 467 и 3, нужно было расположить палочки с цифрами 4, 6 и 7 рядом друг с другом, а затем найти на палочке с цифрой 3 соответствующие произведения. Результат считывался по диагоналям, складывая числа в каждой диагонали для получения окончательного ответа. С гораздо меньшими удобствами производится при помощи этого прибора действие деления.",
  bullets:["Умножение и деление через палочки", "Принцип счета по диагоналям"],
  tags:["умножение","палочки"],
  sources:[
    "https://habr.com/ru/companies/rshb/articles/807291/",
    "https://www.mathematik.uni-marburg.de/~thormae/lectures/ti1/code/napierbones/napierbones.html",
    "https://ru.wikipedia.org/wiki/Палочки_Непера"
  ],
  video:"https://www.youtube.com/watch?v=dkusF7WPTLI",
  videoText:"Умножение с помощью палочек Непера - Youtube",
  quiz:[
    {question:"Кто изобрел?", options:["Паскаль","Непер","Лейбниц"], correct:1},
    {question:"Для чего используются палочки?", options:["Для сложения","Для умножения","Для деления"], correct:1},
    {question:"Когда изобретены?", options:["1617","1642","1673"], correct:0},
    {question:"Как считывается результат?", options:["По диагоналям","По вертикали","По горизонтали"], correct:0}
  ],
  modalImages: [
    "images/hall1/neper.png",
    "images/hall1/neper2.png",
    "images/hall1/neper3.jpg"
  ]},

  {id:"slideRule",
  hall:"hall1",
  icon:"📏",
  kicker:"Домеханическая эпоха",
  name:"Логарифмическая линейка",
  period:"1620–1970-е",
  short:"Аналоговое вычислительное устройство.",
  desc:"Калькулятор для выполнения математических операций, основанный на свойствах логарифмов.",
  history:"Идею, близкую к конструкции логарифмической линейки, высказал в начале XVII века английский астроном Эдмунд Гантер, он предложил нанести на линейку логарифмическую шкалу и с помощью двух циркулей выполнять операции с логарифмами (сложение и вычитание). В 1622 году свой вариант линейки, мало чем отличающийся от современного, опубликовал в трактате «Круги пропорций» Уильям Отред, который и считается автором первой логарифмической линейки. Сначала линейка Отреда была круговой, но в 1633 году было опубликовано описание прямоугольной. Линейка была незаменимым инструментом на протяжении нескольких столетий, до появления электронных калькуляторов в 1970-х годах.",
  work:"Принцип действия логарифмической линейки основан на том, что умножение и деление чисел заменяется соответственно сложением и вычитанием их логарифмов. Простейшая логарифмическая линейка состоит из двух шкал в логарифмическом масштабе, способных передвигаться относительно друг друга. Более сложные линейки содержат дополнительные шкалы на корпусе и движке и прозрачный бегунок — прозрачную рамку, на которой нанесены одна или несколько рисок, позволяющих фиксировать на шкалах числа; бегунок может свободно двигаться вдоль корпуса, визирные линии нанесены перпендикулярно шкалам.\n К примеру, для того чтобы вычислить произведение двух чисел, начало или конец подвижной шкалы совмещают с первым множителем на неподвижной шкале, а на подвижной шкале находят второй множитель. Напротив него на неподвижной шкале находится результат умножения этих чисел: log(x) + log(y) = log(xy).",
  bullets:["Многовековое использование","Умножение и деление через логарифмы"],
  tags:["линейка","логарифм"],
  sources:["https://ru.wikipedia.org/wiki/Логарифмическая_линейка"],
  video:"https://rutube.ru/video/7e03ee5a7048650cd108379a4dc731f3/",
  videoText:"Наглядное умножение на логарифмической линейке - Рутуб",
  quiz:[
    {question:"Что представляла из себя логарифмическая линейка?", options:["Линейка","Калькулятор","Компьютер"], correct:1},
    {question:"На чем основана работа?", options:["Синусах","Косинусах","Логарифмах"], correct:2},
    {question:"Кто придумал ?", options:["Непер","Оутред","Бэббидж"], correct:1},
    {question:"Когда использовалась?", options:["До 1970-х","до 2000-х","в настоящее время"], correct:0}
  ],
  modalImages: [
    "images/hall1/log.png",
    "images/hall1/log1.jpg",
    "images/hall1/log2.jpg"
  ]},

];
